[
  {
    "title": "Revisiting Electrocatalyst Design by a Knowledge Graph of Cu-Based Catalysts for CO₂ Reduction",
    "authors": "Yang Gao, Ludi Wang, Xueqing Chen, Yi Du, Bin Wang",
    "year": 2023,
    "doi": "10.1021/acscatal.3c00759",
    "abstract": "Electrocatalysis takes a significant role in the production of sustainable fuels and chemicals. The combination of artificial intelligence and catalytic science is exhibiting great potential to extract, analyze, and predict electrocatalysts. However, the currently developed machine learning approach usually requires a mass of data from density functional theory calculations to train and optimize models. In contrast, a knowledge graph has the potential to extract useful information from a large amount of the literature without referring to density functional theory. Herein, a knowledge graph of Cu-based electrocatalysts for electrocatalytic CO2 reduction is constructed based on a linguistically enriched SciBERT-based framework. This framework retrieves multiple types of entities including material, regulation method, product, Faradaic efficiency, etc. from 757 scientific literature, generates representations with abundant domain-specific semantic information, and exhibits the capability to deal with electrocatalysts for CO2 reduction. The obtained graph shows the development history of related catalysts, builds relationships between the factors associated with catalysis, and provides intuitive charts for researchers to gain useful information. Furthermore, we propose a deep learning-based prediction model, which integrates the semantic information from the scientific literature (word embedding) with the correlation of knowledge triples (graph embedding) and realizes the prediction of the Faradaic efficiency for a targeted case. This work paves the way for catalyst design in the manner of merging artificial intelligence with catalytic science."
  },
  {
    "title": "The Materials Experiment Knowledge Graph",
    "authors": "Michael J. Statt, Brian A. Rohr, Dan Guevarra, Ja'Nya Breeden, Santosh K. Suram, John M. Gregoire",
    "year": 2023,
    "doi": "10.1039/D3DD00067B",
    "abstract": "Materials knowledge is inherently hierarchical. While high-level descriptors such as composition and structure are valuable for contextualizing materials data, the data must ultimately be considered in the context of its low-level acquisition details. Graph databases offer an opportunity to represent hierarchical relationships among data, organizing semantic relationships into a knowledge graph. Herein, we establish a knowledge graph of materials experiments whose construction encodes the complete provenance of each material sample and its associated experimental data and metadata. Additional relationships among materials and experiments further encode knowledge and facilitate data exploration. We illustrate the Materials Experiment Knowledge Graph (MekG) using several use cases, demonstrating the value of modern graph databases for the enterprise of data-driven materials science."
  },
  {
    "title": "Automating Materials Exploration with a Semantic Knowledge Graph for Li-Ion Battery Cathodes",
    "authors": "Zhiwei Nie, Shisheng Zheng, Yuanji Liu, Zhefeng Chen, Shunning Li, Kai Lei, Feng Pan",
    "year": 2022,
    "doi": "10.1002/adfm.202201437",
    "abstract": "The recent marriage of materials science and artificial intelligence has created the need to extract and collate materials information from the tremendous backlog of academic publications. However, this is notoriously hard to achieve in sophisticated application domains, such as Li-ion battery (LIB) cathodes, which require multiple variables for materials selection, making it challenging to automatically identify the critical terms in the text. Herein, a semantics representation framework, featuring a dual-attention module that refines word embeddings through multi-source information fusion, is proposed for literature mining of LIB cathodes. The word embeddings thus produced are biased toward domain-specific knowledge and can enable the detection of deep-seated associations among materials for targeted applications. Based on this framework, we establish a semantic knowledge graph dedicated to LIB cathodes, which allows us to unravel the latent materials relationships from scientific literature and even to discover candidate materials not yet exploited as cathodes before. This work provides a long-sought path to the realization of text-mining-based knowledge management for complicated materials systems with little dependence on domain expertise."
  },
  {
    "title": "BatteryDataExtractor: Battery-Aware Text-Mining Software Embedded with BERT Models",
    "authors": "Shu Huang, Jacqueline M. Cole",
    "year": 2022,
    "doi": "10.1039/D2SC04322J",
    "abstract": "Due to the massive growth of scientific publications, literature mining is becoming increasingly popular for researchers to thoroughly explore scientific text. In the domain of battery materials, such text-mining efforts face numerous challenges, including terminology ambiguity and the diversity of materials systems. Herein, we present BatteryDataExtractor, a battery-aware text-mining software embedded with BERT models. It is specifically designed to extract battery-relevant informat..."
  },
  {
    "title": "Construction and Application of Materials Knowledge Graph Based on Author Disambiguation: Revisiting the Evolution of LiFePO₄",
    "authors": "Zhiwei Nie, Yuanji Liu, Luyi Yang, Shunning Li, Feng Pan",
    "year": 2021,
    "doi": "10.1002/aenm.202003580",
    "abstract": "Due to the recent innovations in computer technology, the emerging field of materials informatics has now become a catalyst for a revolution of the research paradigm in materials science. In this work, a materials knowledge graph (KG) is constructed based on the automatic disambiguation of author names. LiFePO₄ (LFP), a typical cathode material of lithium-ion batteries, is employed as an example to illustrate the method of KG construction and its application to study the evolutionary ..."
  },
  {
    "title": "MatKG: An Autonomously Generated Knowledge Graph in Materials Science",
    "authors": "Vineeth Venugopal, Elsa Olivetti",
    "year": 2024,
    "doi": "10.1038/s41597-024-03039-z",
    "abstract": "In this paper, we present MatKG, a knowledge graph in materials science that offers a repository of entities and relationships extracted from scientific literature using natural language processing and machine learning. The graph includes over 1 million nodes and 2 million edges, providing a rich knowledge base for materials scientists. This resource is intended to support data-driven materials discovery, by enabling semantic search, relationship exploration, and automated reasoning ..."
  },
  {
    "title": "Material Calculation Collaborates with Grain Morphology Knowledge Graph for Material Properties Prediction",
    "authors": "Ziwen Pan, Chao Shu, Zhuoran Xin, Cheng Xie, Qi Shen, Yun Yang",
    "year": 2022,
    "doi": "10.1109/CSCWD54268.2022.9776104",
    "abstract": "The study of microstructure of materials is of great significance in the field of materials science. This paper proposes adding the morphology features of grains into the construction of grain knowledge graph to enrich the grain information in the graph. First, an autoencoder extracts the grain morphology features and adds them to the grain knowledge graph. Then, the graph convolutional network is used to extract the features of the graph, and the fully connected network is used to pr..."
  },
  {
    "title": "A Materials Terminology Knowledge Graph Automatically Constructed from Text Corpus",
    "authors": "Yuwei Zhang, Fangyi Chen, Zeyi Liu, Yunzhuo Ju, Dongliang Cui, Jinyi Zhu, Xue Jiang, Xi Guo, Jie He, Lei Zhang, Xiaotong Zhang, Yanjing Su",
    "year": 2024,
    "doi": "10.1038/s41597-024-03448-0",
    "abstract": "A scalable, reusable, and broad-coverage unified material knowledge representation shows its importance and will bring great benefits to data sharing among materials communities. In this work, a materials terminology knowledge graph is developed by automatically extracting and organizing concepts from a large-scale scientific text corpus. The resulting knowledge graph contains thousands of concepts and relationships that reflect the structure and terminology of materials science domai..."
  },
  {
    "title": "Materials Data Science Ontology (MDS-Onto): Unifying Domain Knowledge in Materials and Applied Data Science",
    "authors": "Balashanmuga Priyan Rajamohan, Alexander C. Harding Bradley, Van D. Tran, Jonathan E. Gordon, Hayden W. Caldwell, Redad Mehdi, Gabriel Ponon, Quynh D. Tran, Ozan Dernek, Jarod Kaltenbaugh, Benjamin G. Pierce, Raymond Wieser, Weiqi Yue, Kiefer Lin, Jiana Kambo, Christian Lopez, Arafath Nihar, Daniel J. Savage, Donald W. Brown, Hemant Sharma, Brian Giera, Pawan K. Tripathi, Yinghui Wu, Mengjie Li, Roger H. French",
    "year": 2025,
    "doi": "10.1038/s41597-025-04938-5",
    "abstract": "Ontologies have gained popularity in the scientific community as a way to standardize terminologies in organizations’ data. In this work, we propose MDS-Onto, a new ontology aimed at unifying domain knowledge in materials and applied data science. MDS-Onto integrates multiple existing materials ontologies and vocabularies, offering a flexible schema that supports semantic interoperability and enables advanced data analytics. This work demonstrates how MDS-Onto can be applied to improve..."
  },
  {
    "title": "Visual-triggered contextual guidance for lithium battery disassembly: a multi-modal event knowledge graph approach",
    "authors": "Hangbin Zheng, Shimin Liu, Hengjun Zhang, Jiayi Yu, Jinsong Bao",
    "year": 2024,
    "doi": "10.1080/09544828.2024.2301876",
    "abstract": "Lithium battery disassembly is a complex task that presents numerous challenges, including the wide variety of battery types, nonstandard assembly methods, and potential hazards. In this paper, we propose a multi-modal event knowledge graph approach to provide contextual guidance for lithium battery disassembly. The approach combines visual recognition, semantic understanding, and task-level knowledge to assist in safe and efficient disassembly. Experimental results demonstrate the eff..."
  }
]